performance-testing/artillery/load.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:4000' }}"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: Ramp to 100 users equivalent
    - duration: 120
      arrivalRate: 50
      name: Sustain load
    - duration: 30
      arrivalRate: 5
      name: Cool down
  ensure:
    maxErrorRate: 2
    p95: 500

scenarios:
  - name: Mixed API read load
    weight: 7
    flow:
      - get:
          url: /health
      - get:
          url: /api/v1/customers
      - get:
          url: /api/v1/leads
  - name: Analytics dashboard
    weight: 3
    flow:
      - get:
          url: /api/v1/analytics/dashboard