performance-testing/artillery/scenario-01-logins.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:4000' }}"
  phases:
    - duration: 90
      arrivalRate: 30
      maxVusers: 100
  ensure:
    p95: 500

scenarios:
  - name: Concurrent OTP sends
    flow:
      - post:
          url: /api/v1/auth/send-otp
          json:
            phone: "9876543210"