performance-testing/artillery/scenario-02-leads.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:4000' }}"
  phases:
    - duration: 120
      arrivalRate: 40

scenarios:
  - name: Lead creation throughput
    flow:
      - post:
          url: /api/v1/leads
          json:
            firstName: Perf
            lastName: Lead
            phone: "919876543210"
            sourceCode: DSA_APP