performance-testing/artillery/scenario-05-notifications.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:4000' }}"
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 200

scenarios:
  - name: Notification channels
    flow:
      - get:
          url: /api/v1/notifications
      - post:
          url: /api/v1/email/send
          json:
            to: perf@kuberone.com
            subject: Load test
            body: Performance blast