performance-testing/artillery/spike.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:4000' }}"
  phases:
    - duration: 30
      arrivalRate: 5
    - duration: 10
      arrivalRate: 500
      name: Campaign spike
    - duration: 60
      arrivalRate: 500
    - duration: 10
      arrivalRate: 5
    - duration: 30
      arrivalRate: 5

scenarios:
  - name: Spike notifications and campaigns
    flow:
      - get:
          url: /api/v1/campaigns
      - get:
          url: /api/v1/notifications
      - get:
          url: /health