performance-testing/artillery/stress.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:4000' }}"
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
    - duration: 120
      arrivalRate: 100
      rampTo: 300
    - duration: 120
      arrivalRate: 300
      rampTo: 500
    - duration: 60
      arrivalRate: 10
      name: Recovery ramp-down

scenarios:
  - name: Stress health + auth gateway
    flow:
      - get:
          url: /health
      - post:
          url: /api/v1/auth/send-otp
          json:
            phone: "9876543210"